lib/tasks/dev.rake

  task add_default_usuario: :environment do
    Usuario.create!(
      email: 'hubtec@admin.com',
      password: 123456,
      password_confirmation: 123456
    )
---
INSERT INTO "usuarios" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)