app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)

    # Redirecionei para list_path para ficar mais dinâmico. Fiz iss com
    #save, update e destroy.
    respond_to do |format|
      if @list.save
---
INSERT INTO "lists" ("description", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Menradar as 9"], ["completed", 0], ["created_at", "2019-08-25 01:47:38.891917"], ["updated_at", "2019-08-25 01:47:38.891917"]]

  def update
    respond_to do |format|
      if @list.update(list_params)
---
UPDATE "lists" SET "completed" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["completed", 0], ["updated_at", "2019-08-23 06:50:14.877833"], ["id", 3]]